aleksbezruk/BMS_onMCU_BLE/QN908x/board/pin_mux.c
    SYSCON->PIO_FUNC_CFG[2] =
        ((SYSCON->PIO_FUNC_CFG[2] &
          /* Mask bits to zero which are setting */
          (~(SYSCON_PIO_FUNC_CFG_PA16_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA17_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA18_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA20_FUNC_MASK)))

         /* PORTA PIN16 (coords: 29) is configured as FC0_TXD. */
         | SYSCON_PIO_FUNC_CFG_PA16_FUNC(PIO_FUNC_ALT4)

         /* PORTA PIN17 (coords: 28) is configured as FC0_RXD. */
         | SYSCON_PIO_FUNC_CFG_PA17_FUNC(PIO_FUNC_ALT4)

         /* PORTA PIN18 (coords: 27) is configured as GPIOA18. */
         | SYSCON_PIO_FUNC_CFG_PA18_FUNC(PIO_FUNC_ALT0)

         /* PORTA PIN20 (coords: 25) is configured as GPIOA20. */
         | SYSCON_PIO_FUNC_CFG_PA20_FUNC(PIO_FUNC_ALT0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtons:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '21', peripheral: GPIOA, signal: 'GPIOA, 24', pin_signal: GPIOA24/ACMP0N/CS6/ETM_TRACEDAT0/CTIMER3_CAP0/RFE_RX_EN/FC3_SSEL1/SPIFI_IO0, direction: INPUT,
    pull_control: Pull_up, drive_strength: low}
  - {pin_num: '26', peripheral: GPIOA, signal: 'GPIOA, 19', pin_signal: GPIOA19/CS5/SCT0_OUT2/RFE_EN/FC0_SCK/FC3_SSEL3/BLE_IN_PROC, direction: INPUT, pull_control: Pull_up,
    drive_strength: low, drive_extra: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitButtons
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitButtons(void)
{
    /* Enables the clock for the GPIO module */
    CLOCK_EnableClock(kCLOCK_Gpio);

    gpio_pin_config_t gpioa_pin26_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin GPIOA19 (pin 26) */
    GPIO_PinInit(GPIOA, 19U, &gpioa_pin26_config);

    gpio_pin_config_t gpioa_pin21_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin GPIOA24 (pin 21) */
    GPIO_PinInit(GPIOA, 24U, &gpioa_pin21_config);
    const uint32_t portA_pin19_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_MODE_PULLUP |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 19 (coords: 26) is configured as GPIOA19 */
    IOCON_PinMuxSet(IOCON, 0U, 19U, portA_pin19_config);

    const uint32_t portA_pin24_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_MODE_PULLUP |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 24 (coords: 21) is configured as GPIOA24 */
    IOCON_PinMuxSet(IOCON, 0U, 24U, portA_pin24_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDs:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '12', peripheral: GPIOA, signal: 'GPIOA, 31', pin_signal: GPIOA31/DAC/RTC_CAP/CTIMER3_MAT2/SWO/FC3_SCK/SPIFI_CLK, direction: OUTPUT, pull_control: Pull_up,
    drive_strength: low}
  - {pin_num: '32', peripheral: GPIOA, signal: 'GPIOA, 13', pin_signal: GPIOA13/SCT0_OUT4/ACMP1_OUT/FC1_RXD_SDA/FC3_SSEL1/RFE_EN, direction: OUTPUT, pull_control: Pull_up,
    drive_strength: low}
  - {pin_num: '20', peripheral: GPIOA, signal: 'GPIOA, 25', pin_signal: GPIOA25/ACMP0P/CS7/ETM_TRACEDAT1/CTIMER3_CAP1/RFE_TX_EN/FC3_SSEL0/SPIFI_IO1, direction: OUTPUT,
    pull_control: Pull_up, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDs
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDs(void)
{
    /* Enables the clock for the GPIO module */
    CLOCK_EnableClock(kCLOCK_Gpio);

    gpio_pin_config_t gpioa_pin32_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin GPIOA13 (pin 32) */
    GPIO_PinInit(GPIOA, 13U, &gpioa_pin32_config);

    gpio_pin_config_t gpioa_pin20_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin GPIOA25 (pin 20) */
    GPIO_PinInit(GPIOA, 25U, &gpioa_pin20_config);

    gpio_pin_config_t gpioa_pin12_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin GPIOA31 (pin 12) */
    GPIO_PinInit(GPIOA, 31U, &gpioa_pin12_config);
    const uint32_t portA_pin13_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_MODE_PULLUP |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 13 (coords: 32) is configured as GPIOA13 */
    IOCON_PinMuxSet(IOCON, 0U, 13U, portA_pin13_config);

    const uint32_t portA_pin25_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_MODE_PULLUP |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 25 (coords: 20) is configured as GPIOA25 */
    IOCON_PinMuxSet(IOCON, 0U, 25U, portA_pin25_config);

