aleksbezruk/BMS_onMCU_BLE/QN908x/board/pin_mux.c
    const uint32_t portA_pin31_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_MODE_PULLUP |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 31 (coords: 12) is configured as GPIOA31 */
    IOCON_PinMuxSet(IOCON, 0U, 31U, portA_pin31_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UART:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '29', peripheral: FLEXCOMM0, signal: TXD, pin_signal: GPIOA16/CS2/SCT0_OUT1/CTIMER2_MAT0/FC0_TXD/FC3_MOSI/QDEC0_A, pull_control: High_Z, drive_strength: low}
  - {pin_num: '28', peripheral: FLEXCOMM0, signal: RXD, pin_signal: GPIOA17/CS3/SD_DAC/CTIMER2_MAT1/FC0_RXD/FC3_MISO/QDEC0_B, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UART
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UART(void)
{
    const uint32_t portA_pin16_config = (/* Selects pin function 4 */
                                         IOCON_FUNC4 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 16 (coords: 29) is configured as FC0_TXD */
    IOCON_PinMuxSet(IOCON, 0U, 16U, portA_pin16_config);

    const uint32_t portA_pin17_config = (/* Selects pin function 4 */
                                         IOCON_FUNC4 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 17 (coords: 28) is configured as FC0_RXD */
    IOCON_PinMuxSet(IOCON, 0U, 17U, portA_pin17_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPMod_SPI_I2C:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '4', peripheral: FLEXCOMM1, signal: CTS_SDA, pin_signal: GPIOA7/ADC_VREFI/SCT0_OUT2/CTIMER1_CAP0/FC1_CTS_SDA/BLE_PTI1/SPIFI_CSN, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '5', peripheral: FLEXCOMM1, signal: RTS_SCL, pin_signal: GPIOA6/SCT0_OUT3/CTIMER0_MAT2/FC1_RTS_SCL/BLE_PTI0/SPIFI_CLK, pull_control: High_Z, drive_strength: low,
    drive_extra: disabled}
  - {pin_num: '6', peripheral: FLEXCOMM2, signal: SCL_MISO, pin_signal: GPIOA5/ADC3/SCT0_OUT5/CTIMER0_MAT1/FC0_RXD/FC2_SCL_MISO/SPIFI_IO1, pull_control: High_Z, drive_strength: low}
  - {pin_num: '7', peripheral: FLEXCOMM2, signal: SDA_MOSI, pin_signal: GPIOA4/ADC2/SCT0_OUT4/CTIMER0_MAT0/FC0_TXD/FC2_SDA_MOSI/SPIFI_IO0, pull_control: High_Z, drive_strength: low}
  - {pin_num: '8', peripheral: FLEXCOMM2, signal: SDA_SSEL0, pin_signal: GPIOA3/QDEC0_B/SCT0_OUT3/CTIMER0_MAT1/FC2_SDA_SSEL0/RFE_TX_EN, pull_control: High_Z, drive_strength: low}
  - {pin_num: '15', peripheral: FLEXCOMM2, signal: SCK, pin_signal: GPIOA30/ACMP1P/ETM_TRACEDAT3/CTIMER3_MAT1/FC2_SCK/FC3_MOSI/SPIFI_IO3, pull_control: High_Z, drive_strength: low}
  - {pin_num: '33', peripheral: GPIOB, signal: 'GPIOB, 2', pin_signal: GPIOB2/ANT_SW, pull_control: High_Z, drive_strength: low}
  - {pin_num: '12', peripheral: FLEXCOMM3, signal: SCK, pin_signal: GPIOA31/DAC/RTC_CAP/CTIMER3_MAT2/SWO/FC3_SCK/SPIFI_CLK, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPMod_SPI_I2C
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPMod_SPI_I2C(void)
{
    const uint32_t portA_pin3_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 3 (coords: 8) is configured as FC2_SDA_SSEL0 */
    IOCON_PinMuxSet(IOCON, 0U, 3U, portA_pin3_config);

    const uint32_t portA_pin4_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 4 (coords: 7) is configured as FC2_SDA_MOSI */
    IOCON_PinMuxSet(IOCON, 0U, 4U, portA_pin4_config);

    const uint32_t portA_pin5_config = (/* Selects pin function 5 */
                                        IOCON_FUNC5 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 5 (coords: 6) is configured as FC2_SCL_MISO */
    IOCON_PinMuxSet(IOCON, 0U, 5U, portA_pin5_config);

