aleksbezruk/BMS_onMCU_BLE/QN908x/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitETM_TRACE
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitETM_TRACE(void)
{
    const uint32_t portA_pin24_config = (/* Selects pin function 2 */
                                         IOCON_FUNC2 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 24 (coords: 21) is configured as ETM_TRACEDAT0 */
    IOCON_PinMuxSet(IOCON, 0U, 24U, portA_pin24_config);

    const uint32_t portA_pin25_config = (/* Selects pin function 2 */
                                         IOCON_FUNC2 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 25 (coords: 20) is configured as ETM_TRACEDAT1 */
    IOCON_PinMuxSet(IOCON, 0U, 25U, portA_pin25_config);

    const uint32_t portA_pin28_config = (/* Selects pin function 2 */
                                         IOCON_FUNC2 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 28 (coords: 17) is configured as ETM_TRACECLK */
    IOCON_PinMuxSet(IOCON, 0U, 28U, portA_pin28_config);

    const uint32_t portA_pin29_config = (/* Selects pin function 2 */
                                         IOCON_FUNC2 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 29 (coords: 16) is configured as ETM_TRACEDAT2 */
    IOCON_PinMuxSet(IOCON, 0U, 29U, portA_pin29_config);

    const uint32_t portA_pin30_config = (/* Selects pin function 2 */
                                         IOCON_FUNC2 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 30 (coords: 15) is configured as ETM_TRACEDAT3 */
    IOCON_PinMuxSet(IOCON, 0U, 30U, portA_pin30_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSB:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '18', peripheral: USB0, signal: USB_DM, pin_signal: GPIOA27/USB_DM/SCT0_IN1/CTIMER1_MAT2/FC2_SCL_MISO/QDEC0_B/BLE_IN_PROC, pull_control: High_Z, drive_strength: low,
    drive_extra: disabled}
  - {pin_num: '19', peripheral: USB0, signal: USB_DP, pin_signal: GPIOA26/USB_DP/SCT0_IN0/CTIMER1_MAT0/FC2_SDA_MOSI/QDEC0_A/BLE_SYNC, pull_control: High_Z, drive_strength: low,
    drive_extra: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB(void)
{
    const uint32_t portA_pin26_config = (/* Selects pin function 1 */
                                         IOCON_FUNC1 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 26 (coords: 19) is configured as USB_DP */
    IOCON_PinMuxSet(IOCON, 0U, 26U, portA_pin26_config);

    const uint32_t portA_pin27_config = (/* Selects pin function 1 */
                                         IOCON_FUNC1 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 27 (coords: 18) is configured as USB_DM */
    IOCON_PinMuxSet(IOCON, 0U, 27U, portA_pin27_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitG_Sensor:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '5', peripheral: FLEXCOMM1, signal: RTS_SCL, pin_signal: GPIOA6/SCT0_OUT3/CTIMER0_MAT2/FC1_RTS_SCL/BLE_PTI0/SPIFI_CLK, pull_control: High_Z, drive_strength: low,
    drive_extra: disabled}
  - {pin_num: '4', peripheral: FLEXCOMM1, signal: CTS_SDA, pin_signal: GPIOA7/ADC_VREFI/SCT0_OUT2/CTIMER1_CAP0/FC1_CTS_SDA/BLE_PTI1/SPIFI_CSN, pull_control: High_Z,
    drive_strength: low}
  - {pin_num: '31', peripheral: GPIOA, signal: 'GPIOA, 14', pin_signal: GPIOA14/CS0/ANT_SW/CTIMER2_CAP0/FC0_RTS/FC3_SSEL0/QDEC1_A, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitG_Sensor
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitG_Sensor(void)
{
    const uint32_t portA_pin6_config = (/* Selects pin function 4 */
                                        IOCON_FUNC4 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 6 (coords: 5) is configured as FC1_RTS_SCL */
    IOCON_PinMuxSet(IOCON, 0U, 6U, portA_pin6_config);

    const uint32_t portA_pin7_config = (/* Selects pin function 4 */
                                        IOCON_FUNC4 |
                                        /* Selects High-Z function */
                                        IOCON_MODE_HIGHZ |
                                        /* Enable low drive strength */
                                        IOCON_DRIVE_LOW);
    /* PORTA PIN 7 (coords: 4) is configured as FC1_CTS_SDA */
    IOCON_PinMuxSet(IOCON, 0U, 7U, portA_pin7_config);

    const uint32_t portA_pin14_config = (/* Selects pin function 0 */
                                         IOCON_FUNC0 |
                                         /* Selects High-Z function */
                                         IOCON_MODE_HIGHZ |
                                         /* Enable low drive strength */
                                         IOCON_DRIVE_LOW);
    /* PORTA PIN 14 (coords: 31) is configured as GPIOA14 */
    IOCON_PinMuxSet(IOCON, 0U, 14U, portA_pin14_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI_FLASH:
- options: {prefix: BOARD_, coreID: cm4}
- pin_list:
  - {pin_num: '8', peripheral: FLEXCOMM2, signal: SDA_SSEL0, pin_signal: GPIOA3/QDEC0_B/SCT0_OUT3/CTIMER0_MAT1/FC2_SDA_SSEL0/RFE_TX_EN, pull_control: High_Z, drive_strength: low}
  - {pin_num: '6', peripheral: FLEXCOMM2, signal: SCL_MISO, pin_signal: GPIOA5/ADC3/SCT0_OUT5/CTIMER0_MAT1/FC0_RXD/FC2_SCL_MISO/SPIFI_IO1, pull_control: High_Z, drive_strength: low}
  - {pin_num: '7', peripheral: FLEXCOMM2, signal: SDA_MOSI, pin_signal: GPIOA4/ADC2/SCT0_OUT4/CTIMER0_MAT0/FC0_TXD/FC2_SDA_MOSI/SPIFI_IO0, pull_control: High_Z, drive_strength: low}
  - {pin_num: '15', peripheral: FLEXCOMM2, signal: SCK, pin_signal: GPIOA30/ACMP1P/ETM_TRACEDAT3/CTIMER3_MAT1/FC2_SCK/FC3_MOSI/SPIFI_IO3, pull_control: High_Z, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

